<?php
/*//Задание №1
$i = 0;
while ($i <= 100) {
  if ($i % 3 == 0) 
    echo $i . "<br>";
  $i++;
}

//Задание №2
$i = 0;
do {
  if ($i == 0) 
    echo $i . " - ноль<br>";
  elseif ($i % 2 == 1) 
    echo $i . " - нечетное число<br>";
  else 
    echo $i . " - четное число<br>";
  $i++;
} while ($i <= 10);

//Задание №3
$arr = [
  "Московская область" => [
    "Москва", "Зеленоград", "Клин"
  ],
  "Ленинградская область" => [
    "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
  ],
  "Пермский край" => [
    "Пермь", "Березники", "Губаха"
  ]
];
foreach ($arr as $region => $city) {
  echo $region . ":<br>" . implode(', ', $city) . "<br>";
}

//Задание №4
function translit($str){
$arr = ['a' =>'a',
        'б' => 'b',
        'в' => 'v',
        'г' => 'g',
        'д' => 'd',
        'е' => 'e',
        'ж' => 'zh',
        'з' => 'z',
        'и' => 'i',
        'к' => 'k',
        'л' => 'l',
        'м' => 'm',
        'н' => 'n',
        'о' => 'o',
        'п' => 'p',
        'р' => 'r',
        'с' => 's',
        'т' => 't',
        'у' => 'u',
        'ф' => 'f',
        'х' => 'h',
        'ц' => 'ts',
        'ч' => 'ch',
        'ш' => 'sh',
        'щ' => 'sch',
        'ы' => 'y',
        'ь' => '\'',
        'ъ' => '',
        'э' => 'e',
        'ю' => 'yu',
        'я' => 'ya',
        'Б' => 'B',
        'В' => 'V',
        'Г' => 'G',
        'Д' => 'D',
        'Е' => 'E',
        'Ж' => 'Zh',
        'З' => 'Z',
        'И' => 'I',
        'К' => 'K',
        'Л' => 'L',
        'М' => 'M',
        'Н' => 'N',
        'О' => 'O',
        'П' => 'P',
        'Р' => 'R',
        'С' => 'S',
        'Т' => 'T',
        'У' => 'U',
        'Ф' => 'F',
        'Х' => 'H',
        'Ц' => 'Ts',
        'Ч' => 'Ch',
        'Ш' => 'Sh',
        'Щ' => 'Sch',
        'Э' => 'E',
        'Ю' => 'Yu',
        'Я' => 'Ya'];
$newStr = strtr($str, $arr);
  return $newStr;
}

echo translit('Съешь апельсинчик');

//Задание №5
function change($str){
  $newStr = strtr($str, ' ', '_');
  return $newStr;
}

echo change('Merry Christmas and Happy New Year');

//Задание №6 - см. myphp_template.php
 //Задание № 7
 for ($i=0; $i < 10; print $i . "<br>", $i++) { }
 
//Задание №8
$arr = [
  "Московская область" => [
    "Москва", "Зеленоград", "Клин"
  ],
  "Ленинградская область" => [
    "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
  ],
  "Пермский край" => [
    "Пермь", "Березники", "Губаха"
  ]
];
foreach ($arr as $region => $cities) {
  foreach ($cities as $city) {
    if (mb_substr($city, 0, 1) == 'К') {
      echo $city . "<br>";
    }
  }
}
*/
//Задание №9
function translit($str){
  $arr = ['a' =>'a',
          'б' => 'b',
          'в' => 'v',
          'г' => 'g',
          'д' => 'd',
          'е' => 'e',
          'ж' => 'zh',
          'з' => 'z',
          'и' => 'i',
          'й' => 'i',
          'к' => 'k',
          'л' => 'l',
          'м' => 'm',
          'н' => 'n',
          'о' => 'o',
          'п' => 'p',
          'р' => 'r',
          'с' => 's',
          'т' => 't',
          'у' => 'u',
          'ф' => 'f',
          'х' => 'h',
          'ц' => 'ts',
          'ч' => 'ch',
          'ш' => 'sh',
          'щ' => 'sch',
          'ы' => 'y',
          'ь' => '\'',
          'ъ' => '',
          'э' => 'e',
          'ю' => 'yu',
          'я' => 'ya',
          'Б' => 'B',
          'В' => 'V',
          'Г' => 'G',
          'Д' => 'D',
          'Е' => 'E',
          'Ж' => 'Zh',
          'З' => 'Z',
          'И' => 'I',
          'Й' => 'I',
          'К' => 'K',
          'Л' => 'L',
          'М' => 'M',
          'Н' => 'N',
          'О' => 'O',
          'П' => 'P',
          'Р' => 'R',
          'С' => 'S',
          'Т' => 'T',
          'У' => 'U',
          'Ф' => 'F',
          'Х' => 'H',
          'Ц' => 'Ts',
          'Ч' => 'Ch',
          'Ш' => 'Sh',
          'Щ' => 'Sch',
          'Э' => 'E',
          'Ю' => 'Yu',
          'Я' => 'Ya',
          ' ' => '_'];
  $newStr = strtr($str, $arr);
    return $newStr;
  }
  
  echo translit('Говорят, чтобы уверенно чувствоать себя в новом ЯП, нужно писать код 800 часов');